app/views/articles/index.html.erb

SELECT  `ulogins`.* FROM `ulogins`  ORDER BY `ulogins`.`id` ASC LIMIT 1
---
<%= link_to 'Log out', ulogins_path %>
<%= link_to 'Change Password', edit_ulogin_path(Ulogin.first.id) %>