app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "content", "created_by", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Article"], ["content", "C"], ["created_by", "Ad"], ["created_at", "2016-04-01 08:59:34.281295"], ["updated_at", "2016-04-01 08:59:34.281295"]]

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE "articles" SET "title" = ?, "content" = ?, "created_by" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Article"], ["content", "Updated Article"], ["created_by", "User66"], ["updated_at", "2016-04-11 06:29:00.303668"], ["id", 9]]