app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "v"], ["created_at", "2016-04-01 09:00:26.378330"], ["updated_at", "2016-04-01 09:00:26.378330"]]