app/controllers/comments_controller.rb

  def index
    @comments = Comment.all
---
SELECT `comments`.* FROM `comments`

  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "mdbndnn"], ["body", ",mmvjvv"], ["article_id", 0], ["created_at", "2016-04-05 07:33:44.825926"], ["updated_at", "2016-04-05 07:33:44.825926"]]