app/controllers/roles_controller.rb

  def create
    @role = Role.new(role_params)

    respond_to do |format|
      if @role.save
---
INSERT INTO "roles" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "df"], ["created_at", "2016-04-01 09:00:15.136323"], ["updated_at", "2016-04-01 09:00:15.136323"]]

  def destroy
    @role.destroy
---
DELETE FROM "roles" WHERE "roles"."id" = ?  [["id", 1]]

    def set_role
      @role = Role.find(params[:id])
---
SELECT  "roles".* FROM "roles" WHERE "roles"."id" = ? LIMIT 1  [["id", 1]]