app/controllers/ulogins_controller.rb

SELECT  "ulogins".* FROM "ulogins" WHERE "ulogins"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @ulogin = Ulogin.find(params[:id])

INSERT INTO "ulogins" ("name", "emali", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", ""], ["emali", "manjunath.p@nighthack.in"], ["created_at", "2016-04-05 07:22:28.692309"], ["updated_at", "2016-04-05 07:22:28.692309"]]
---
  def create
    @ulogin = Ulogin.new(ulogin_params)

    respond_to do |format|
      if @ulogin.save

SELECT  "ulogins".* FROM "ulogins" WHERE "ulogins"."id" = ? LIMIT 1  [["id", 1]]
---
  def update
    @ulogin = Ulogin.find(params[:id])

SELECT  "ulogins".* FROM "ulogins" WHERE "ulogins"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_ulogin
      @ulogin = Ulogin.find(params[:id])