app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "user1a"], ["email", "kd@supplythis.in"], ["created_at", "2016-04-01 09:00:01.838433"], ["updated_at", "2016-04-01 09:00:01.838433"]]